ehrenhasz/anvilos_alpha/oss_sovereignty/sources/sys_09_Anvil/source/ports/esp32/boards/ESP32_GENERIC_S2/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "Generic ESP32S2 module"
#define MICROPY_HW_MCU_NAME "ESP32S2"

#define MICROPY_PY_BLUETOOTH (0)
#define MICROPY_HW_ENABLE_SDCARD (0)


#define MICROPY_HW_ENABLE_UART_REPL         (1)
